In [1]:
import pandas as pd


data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [24, 27, 22, 32, 29],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston
4      Eva   29      Phoenix

# loc

In [2]:
df.loc[0:2]

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [3]:
df.loc[0:2, ['Name']]

      Name
0    Alice
1      Bob
2  Charlie

# iloc

In [4]:
df.iloc[0:2]

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

In [5]:
df.iloc[0:2, 0]

0    Alice
1      Bob
Name: Name, dtype: object

In [6]:
df.iloc[0:2, 0:2]

    Name  Age
0  Alice   24
1    Bob   27

Differences between .loc[] and .iloc[]:
.loc[]: Selects data based on labels (row names and column names).
.iloc[]: Selects data based on integer positions (row and column indices).